Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/death_related_benefits/special_funeral_grant.html.txt.tmx
Source language: en
Languages: ga

source: If someone dies at work, a special Funeral Grant is available under the Occupational Injuries Benefit scheme
ga: Tá Deontas Speisealta Sochraide ar fáil faoin scéim Sochair Gortuithe Ceirde

source: To be eligible for this grant, the death must have resulted from:
ga: Chun a bheith i dteideal an deontais seo, caithfidh an bás a bheith mar thoradh ar:

source: • An accident at work,
ga: • Timpist ag an obair,

source: • An accident while travelling directly to or from work
ga: • Timpist agus an duine ag taisteal go díreach chuig nó ón obair

source: The person must have paid a minimum of one week's PRSI
ga: Caithfidh ar a laghad seachtain amháin íocaíochtaí ÁSPC a bheith déanta

source: This special funeral grant is paid under the Occupational Injuries Benefits scheme instead of the Widowed Person's Bereavement Grant
ga: Íoctar an deontas speiseálta sochraide seo faoin scéim Sochair Gortuithe Ceirde in áit an Deontais Báis do Bhaintreach/ Baintreach Fir nó an Gnáth Dheontas

source: Special Funeral Grant: €850
ga: Deontas Speisealta Sochraide: €850

source: To apply download and complete claim form OB 61 (pdf)
ga: Chun d'iarratas a dhéanamh líon isteach Foirm OB 61 (pdf)

source: To apply you need:
ga: Chun iarratas a dhéanamh beidh gá agat le:

source: • The original Death Certificate/interim Death Certificate
ga: • Bunchóip den Teastas Báis/Teastas Báis Sealadach

source: • A copy of the death notice
ga: • Cóip den fógra báis

source: • A note of the funeral expenses
ga: • Nóta de na costaisí sochraide
